README.org
#+OPTIONS: \n:t
#+OPTIONS: ^:{}
[[file:README-en.md::#%20emacs-sftp][Readme here in English]]
* emacs-sftp
是使用SCP命令将文件传输到远程服务器
* 安装
在配置文件中引入sftp.el
#+BEGIN_SRC emacs-lisp
(require 'sftp)
#+END_SRC
** linux 环境依赖
+ scp
+ sshpass
#+BEGIN_SRC shell
apt-get install sshpass
#+END_SRC
** windows 环境依赖
+ pscp
[[https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html][下载pscp并将其加入到PATH中]]
* 配置文件
在当前项目下的.dir-locals.el中设置远程连接信息
#+BEGIN_SRC emacs-lisp
((nil
  (host ."127.0.0.1")
  (user ."username")
  (password ."password")
  (remote_path ."/www") ;;远程项目路径
  (port ."22")
))
#+END_SRC
需要读取本地变量，建议在引入sftp之前加入
#+BEGIN_SRC emacs-lisp
(setq enable-local-variables :all enable-local-eval t)
  (hack-dir-local-variables)
#+END_SRC
* 用法
+ sftp-get 下载当前文件
+ sftp-put 上传当前文件
+ sftp-get-directory 下载目录文件
+ sftp-put-directory 上传目录文件
